Repository: osm-ua/osm-tasking-manager2
Catalog: osmtm/locale/*/LC_MESSAGES/osmtm.po
Languages: hu

source: Stop working on this task and unlock it. You may resume work on it again later.
hu: Munka befejezése a feladaton és zárolás feloldása. Később bármikor folytathatod rajta a munkát.

source: Submit for review when all instructions are completed.
hu: Beküldés átnézésre, ha minden utasítást végrehajtottál.

source: Mark task as done
hu: Feladat késznek jelölése

source: Lock this task to tell others that you are currently working on it.
hu: Zárold a feladatot, jelezve másoknak, hogy épp dolgozol rajta.

source: Start mapping
hu: Térképezés megkezdése

source: Lock this task to tell others that you are currently reviewing it. Validate that this task has been mapped correctly and completely.
hu: Zárold a feladatot, jelezve másoknak, hogy épp átnézed. Ellenőrizd, hogy a feladat helyesen és teljesen lett feltérképezve.

source: Review the work
hu: A munka átnézése

source: User profile
hu: Felhasználói fiók

source: User: ${username}
hu: Felhasználó: ${username}

source: This is <b>You</b>!
hu: Ez <b>te</b> vagy!

source: OSM User Profile
hu: OSM felhasználói profil

source: OSM Profile
hu: OSM profil

source: This user joined OSM
hu: Ez a felhasználó csatlakozott az OSM-hez

source: OSM User Changeset History
hu: OSM felhasználói módosításcsomag előzmények

source: OSM Edit History
hu: OSM szerkesztési előzmények

source: This user has submitted ${changes} total changeset.
hu: Ez a felhasználó összesen ${changes} módosításcsomagot küldött be.

source: This user is an administrator.
hu: Ez a felhasználó adminisztrátor.

source: Remove privileges
hu: Jogosultságok megvonása.

source: Set as administrator
hu: Kinevezés adminisztrátornak

source: This user is a project manager.
hu: Ez a felhasználó projektmenedzser.

source: Set as project manager
hu: Kinevezés projektmenedzsernek

source: This user contributed to the following projects:
hu: Ez a felhasználó a következő projektekben működött közre:

source: Project Details
hu: Projekt részletei

source: ${count} tile
hu: ${count} csempe

source: User hasn't contributed yet.
hu: A felhasználó még nem járult hozzá.

source: From
hu: Feladó

source: Your page
hu: A te oldalad

source: logout
hu: kilépés

source: Users list
hu: Felhasználólista

source: Manage licenses
hu: Licencek kezelése

source: Create a new project
hu: Új projekt létrehozása

source: Users
hu: Felhasználók

source: Keys:
hu: Kulcsok:

source: Administrator
hu: Adminisztrátor

source: Project Manager
hu: Projektmenedzser

source: License doesn't exist!
hu: A licenc nem létezik!

source: License removed!
hu: A licenc eltávolítva!

source: License created!
hu: A licenc létrehozva!

source: License updated!
hu: A licenc frissítve!

source: Sorry, this project doesn't exist
hu: Ez a projekt sajnos nem létezik

source: Untitled project
hu: Névtelen projekt

source: Project #${project_id} created successfully
hu: A(z) #${project_id} projekt sikeresen létrejött

source: Sorry, could not create the project. <br />%s
hu: Sajnálom, nem hozható létre a projekt. <br />%s

source: Successfully imported ${n} geometry
hu: ${n} geometria sikeresen importálva

source: A comment is required.
hu: Megjegyzés szükséges.

source: Please type the project id in the box to confirm
hu: Gépeld be a dobozba a projekt azonosítóját a megerősítéshez

source: No done tasks to invalidate.
hu: Nincs elkészült feladat az érvénytelenítéshez.

source: %d task invalidated
hu: %d feladat érvénytelenítve

source: A subject and message are required.
hu: Tárgy és üzenet megadása kötelező.

source: Project #
hu: Projekt #

source: No users to message.
hu: Nincs felhasználó, akinek üzenhetnél.

source: Message sent to ${num} user.
hu: Üzenet elküldve ${num} felhasználónak.

source: Cannot update task. Record lock for update.
hu: Nem lehet frissíteni a feladatot. Rögzítsd a zárat a frissítésnél.

source: This task doesn't exist.
hu: Ez a feladat nem létezik.

source: You need to lock the task first.
hu: Először zárolnod kell a feladatot.

source: Task marked as done. Thanks for your contribution
hu: A feladat késznek jelölve. Köszönjük a közreműködésedet

source: Task already locked.
hu: Már zárolt feladat.

source: Task assigned to someone else.
hu: Feladat valaki másnak kiosztva.

source: Task locked. You can start mapping.
hu: Feladat zárolva. Elkezdheted a térképezést.

source: Task unlocked.
hu: Feladat feloldva.

source: Comment added.
hu: Hozzászólás hozzáadva.

source: You were mentioned in a comment - Task ${link}
hu: Megemlítettek egy hozzászólásban - Feladat: ${link}

source: Task ${link} invalidated
hu: A ${link} feladat érvénytelenítve

source: Task validated.
hu: Feladat érvényesítve.

source: Task invalidated.
hu: Feladat érvénytelenítve.

source: Random task... none available! Sorry.
hu: Feladat találomra... hát, az most nincs, sajnos.

source: You cannot assign an already locked task
hu: Nem oszthatsz ki egy már zárolt feladatot.

source: Task assigned.
hu: Feladat kiosztva.

source: Task assignment removed
hu: Feladatkiosztás visszavonva.

source: Task difficulty changed.
hu: A feladat nehézsége megváltozott.

source: Task difficulty removed
hu: A feladat nehézsége eltávolítva

source: You probably don't want to remove your privileges
hu: A saját jogosultságaidtól aligha szeretnél megválni

source: Sorry, this user doesn't exist
hu: Ez a felhasználó sajnos nem létezik
