Repository: osm-ua/osm-tasking-manager2
Catalog: osmtm/locale/*/LC_MESSAGES/osmtm.po
Languages: hu

source: About the Tasking Manager
hu: A Tasking Managerről

source: Sponsorship and Funding
hu: Szponzorálás, támogatás

source: OSM Tasking Manager was designed and built for the <a href="http://hot.openstreetmap.org">Humanitarian OpenStreetMap Team</a>.
hu: Az OSM Tasking Manager a <a href="http://hot.openstreetmap.org">Humanitárius OpenStreetMap Csapat</a> számára készült.

source: With the invaluable help from:
hu: Az ő nélkülözhetetlen segítségükkel:

source: Getting Started
hu: Első lépések

source: Some resources to help you start using the Tasking Manager:
hu: Hasznos segédletek a Tasking Manager használatához:

source: Open Source
hu: Nyílt forráskód

source: OSM Tasking Manager is an open source software.<br>Feel free to report issues and contribute.
hu: Az OSM Tasking Manager nyílt forráskódú szoftver.<br>Bátran jelezd a problémákat és működj közre a fejlesztésben.

source: The <a href="http://github.com/hotosm/osm-tasking-manager2">application code</a> is available on github
hu: Az <a href="http://github.com/hotosm/osm-tasking-manager2">alkalmazás forráskódja</a> elérhető a githubon

source: Lead developer: Pierre GIRAUD (<a href="//www.camptocamp.com">Camptocamp</a>)
hu: Vezető fejlesztő: Pierre GIRAUD (<a href="//www.camptocamp.com">Camptocamp</a>)

source: with the help of <a href="https://github.com/hotosm/osm-tasking-manager2/graphs/contributors">other contributors</a>.
hu: a <a href="https://github.com/hotosm/osm-tasking-manager2/graphs/contributors">többi közreműködő</a> segítségével.

source: Version
hu: Verzió

source: You have unread messages
hu: Olvasatlan üzeneted van

source: About
hu: Névjegy

source: login to OpenStreetMap
hu: OpenStreetMap bejelentkezés

source: Fork the code on ${github_link}.
hu: Forkold a forrást: ${github_link}.

source: OSM Tasking Manager is a mapping tool designed and built for the Humanitarian OSM Team collaborative mapping. The purpose of the tool is to divide up a mapping job into smaller tasks that can be completed rapidly. It shows which areas need to be mapped and which areas need the mapping validated.
hu: Az OSM Tasking Manager egy térképező eszköz, ami a Humanitárius OpenStreetMap Csapat kollaboratív térképezéséhez készült. Az eszköz célja a térképezési munka kisebb, gyorsan elvégezhető feladatokra osztása. Mutatja, mely területek várnak még feltérképezésre és hol kell a térképezést ellenőrizni.

source: This approach facilitates the distribution of tasks to the various mappers in a context of emergency. It also permits control of the progress and the homogeneity of the work done (e.g. elements to cover, specific tags to use, etc.).
hu: Ez a megközelítés megkönnyíti a feladatok elosztását a szerkesztők között egy rendkívüli helyzetben. Lehetővé teszi továbbá az előrehaladás követését és javítja az elvégzett munka homogenitását (pl. feltérképezendő objektumok, használandó címkékt, stb.)

source: New to Mapping?
hu: Még nem térképeztél?

source: Just jump over to <a target="_blank" href="http://www.openstreetmap.org">OpenStreetMap</a>, create an account, and then visit the LearnOSM tutorials on the <a target="_blank" href="http://learnosm.org/en/coordination/tasking-manager/">Tasking Manager</a> and the <a target="_blank" href="http://learnosm.org/en/beginner/id-editor">iD editor</a>. Alternatively check out the <a target="_blank" href="http://mapgive.state.gov">MapGive website</a> which also provides information on the Tasking Manager and mapping. Once you have read up on how to map, come back here to help map for people on the ground!
hu: Ugorj át az <a target="_blank" href="http://www.openstreetmap.org">OpenStreetMapre</a>, regisztrálj és olvasd el LearnOSM útmutatóit a <a target="_blank" href="http://learnosm.org/en/coordination/tasking-manager/">Tasking Managerről</a> és az <a target="_blank" href="http://learnosm.org/en/beginner/id-editor">iD editorról</a>. A <a target="_blank" href="http://mapgive.state.gov">MapGive</a> oldalán is találsz leírást a Tasking Managerről és a térképezésről. Ha elolvastad, hogyan kell térképezni, gyere vissza és segíts térképet készíteni a terepen lévőknek!

source: Questions About Tasks, Mapping or HOT?
hu: Kérdések a feladatokról, a térképezésről vagy a HOT-ról?

source: If you have any questions about a project, a task or mapping in general please ask on our mailing list: <a href="https://lists.openstreetmap.org/listinfo/hot">HOT E-Mail List</a>.
hu: Ha kérdésed van egy projekttel kapcsolatban, egy feladatról, vagy általában a térképezésről, kérdezz bátran a levelező listánkon: <a href="https://lists.openstreetmap.org/listinfo/hot">HOT Levelező Lista</a>.

source: Or visit us in our IRC Chat Channel, just select #hot from the pop down channel list: <a href="http://irc.openstreetmap.org/">OSM HOT IRC Channel #hot</a>.
hu: Vagy látogasd meg az IRC csatornánkat, keresd a #hot csatornát a legördülőben: <a href="http://irc.openstreetmap.org/">OSM HOT IRC csatorna #hot</a>.

source: General inquries and comments are welcomed at: <a href="mailto:info@hotosm.org" target="_top">info@hotosm.org</a>.
hu: Általános érdeklődést és megjegyzéseket szevesen fogadunk: <a href="mailto:info@hotosm.org" target="_top">info@hotosm.org</a>.

source: Email HOT at
hu: Email a HOT-nak:

source: Follow HOT on
hu: Kövesd a HOT-ot:

source: Like HOT on
hu: Lájkold a HOT-ot:

source: Please donate!
hu: Kérjük adományozz!

source: urgent
hu: sürgős

source: high
hu: magas

source: medium
hu: közepes

source: low
hu: alacsony

source: Access to this project is limited
hu: Ehhez a projekthez korlátozva van a hozzáférés

source: Created by
hu: Létrehozta

source: Updated
hu: Frissítve

source: Priority:
hu: Prioritás:

source: High priority first
hu: Magas prioritású elöl

source: Creation date
hu: Létrehozás dátuma

source: Last update
hu: Utolsó frissítés

source: Projects
hu: Projektek

source: Search
hu: Keresés

source: Sort by:
hu: Keresés:

source: Your projects
hu: A te projektjeid

source: Include archived projects
hu: Belevéve az archív projekteket

source: ${locked} user is currently working on this project
hu: ${locked} felhasználó dolgozik jelenleg ezen a projekten

source: imagery url available only after accepting the license
hu: a legifelvétel URL-je a licenc elfogadás után lesz elérhető

source: ${license} license agreement
hu: ${license} licencszerződés

source: Access to this imagery is limited by the ${license_agreement_link}.
hu: A képhez történő hozzáférést a következő licencszerződés korlátozza: ${license_agreement_link}.

source: You have already acknowledged the terms of this license.
hu: Már elfogadtad a licencfeltételeket.

source: review and acknowledge
hu: Nézd át és fogadd el

source: You need to ${review_and_acknowledge_link} the agreement.
hu: ${review_and_acknowledge_link} a feltételeket.

source: You need to accept the license first
hu: Először el kell fogadnod a licencfeltételeket

source: Edit License
hu: Licenc szerkesztése

source: Name
hu: Név

source: A name for the license (provider, for example)
hu: A licenc neve (például szolgáltató)

source: Description
hu: Leírás

source: The license terms
hu: A licencfeltételek

source: Plain Text
hu: Egyszerű szöveg

source: A short version of the terms
hu: A feltételek rövid változata

source: Save the modifications
hu: Módosítások elmentése

source: Create the new license
hu: Az új licenc létrehozása

source: Delete
hu: Törlés

source: Cancel
hu: Mégse

source: Are you sure you want to delete this license?
hu: Biztosan törölni akarod ezt a licencet?

source: Licenses
hu: Licencek

source: ${license_name} License Acknowledgement
hu: ${license_name} Licenc elismerés

source: Access via this site to imagery identified as <em>"${license_name}"</em> is subject to the following usage terms:
hu: A légifelvétél ezen az oldalon <em>"${license_name}"</em> licenc alatt érhető el az alábbi feltételek szerint:

source: I AGREE
hu: ELFOGADOM

source: No, thank you
hu: Köszönöm, nem

source: edit
hu: szerkesztés

source: Create new license
hu: Új licenc létrehozása

source: Messages
hu: Üzenetek

source: From:
hu: Feladó:

source: You have tasks assigned:
hu: Kijelölt feladataid vannak:

source: This project is not published yet.
hu: Ez a projekt még nem lett publikálva.

source: Publish
hu: Publikálás

source: This project was archived.
hu: Ez a projekt archiválva lett.

source: Instructions
hu: Utasítások

source: Edit
hu: Szerkesztés

source: Are you sure?
hu: Biztos vagy benne?

source: This will mark all tasks currently marked as 'done' as invalid. Please use this only if you are sure of what you are doing.
hu: Ez az összes, már „kész”-nek jelölt feladatot érvényteleníti. Kérlek, csak akkor használd, ha tudod, mit csinálsz.

source: Please leave a comment. It will be displayed in all the invalidated tasks.
hu: Kérlek, hagyj üzenetet. Ez lesz látható az összes érvénytelenített feladaton.

source: This will be sent as the invalidation comment to users.
hu: Ez lesz érvénytelenítési megjegyzésként elküldve a felhasználóknak.

source: Please type in the project number id of the repository to confirm.
hu: Kérlek, add meg a tároló projekt szám azonosítóját a megerősítéshez.

source: Invalidate all done tasks
hu: Az összes elkészült feladat érvénytelenítése

source: Message all contributors
hu: Üzenet az összes közreműködőnek

source: This will send a Tasking Manager message to every contributor of the current project.
hu: Egy Tasking Manager üzenetet küld az aktuális projekt összes közreműködőjének.

source: Please use this feature conservatively.
hu: Kérlek használd ezt a lehetőséget óvatosan.

source: Subject
hu: Tárgy

source: Message
hu: Üzenet

source: This message does not automatically translate, so you may want to include your own translations.
hu: Ez az üzenet nem lesz automatikusan lefordítva, ezért beleírhatod a saját fordításaidat.

source: Area
hu: Terület

source: Imagery
hu: Légifelvétel

source: Priority Areas
hu: Prioritásos területek

source: Allowed Users
hu: Engedélyezett felhasználók

source: Misc
hu: Egyéb

source: Status
hu: Állapot

source: Archived
hu: Archivált

source: Published
hu: Publikált

source: Draft
hu: Vázlat

source: Priority
hu: Prioritás

source: Name of the project
hu: Projekt neve

source: Short Description
hu: Rövid leírás

source: Entities to Map
hu: Térképezendő objektumok

source: primary roads, secondary roads, buildings
hu: fő- és mellékutak, épületek

source: The list of entities to map.
hu: A térképezendő objektumok listája.

source: Changeset Comment
hu: Módosításcsomag megjegyzés

source: Default comments added to uploaded changeset comment field. Users should also be encouraged add text describing what they mapped.
hu: Egy alapértelmezett megjegyzés lett megadva a módosításcsomag megjegyzés mezőjében. A felhasználókat ösztönözni kell, hogy írják hozzá, mit térképeztek.

source: Example defaults:
hu: Példa alapértelmezések:

source: Hashtags are sometimes used for analysis later, but should be human informative and not overused, #group #event for example.
hu: A hashtagek általában későbbi elemzések céljából használatosak, de emberek számára is értelmesek kell legyenek és nem agyonhasználtak, pl. #csoport, #esemény.

source: Detailed Instructions
hu: Részletes útmutató

source: Per Task Instructions (optional)
hu: Feladatonkénti utasítások (opcionális)

source: Put here anything that can be useful to users while taking a task. {x}, {y} and {z} will be replaced by the corresponding parameters for each task.
hu: Adj meg itt mindent, ami hasznos lehet a felhasználónak a feladat végzése során. {x}, {y} és {z} be lesznek helyettesítve az egyes feladatok megfelelő paramétereivel.

source: For example:
hu: Például:

source: This task involves loading extra data. Click [here](http://localhost:8111/import?new_layer=true&url=http://www.domain.com/data/{x}/{y}/{z}/routes_2009.osm) to load the data into JOSM
hu: Ez a feladat további adatok betöltésével jár. Kattints [ide](http://localhost:8111/import?new_layer=true&url=http://www.domain.com/data/{x}/{y}/{z}/routes_2009.osm), hogy az adatok betöltődjenek a JOSM szerkesztőbe

source: Put here anything that can be useful to users while taking a task. If you have added extra properties within the GeoJSON of the task, they can be referenced by surrounding them in curly braces. For eg. if you have a property called "import_url" in your GeoJSON, you can reference it like:
hu: Írj ide mindent, ami hasznos lehet a felhasználónak egy feladat elvégzéséhez. Ha a GeoJSON fájlban extra tulajdonságok voltak, hivatkozhatsz rájuk a tulajdonság nevét kapcsos zárójelbe rakva. Pl. ha van egy „import_url” tulajdonságod a GeoJSON-ben, így hivatkozhatsz rá:

source: This task involves loading extra data. Click [here](http://localhost:8111/import?new_layer=true&url={import_url}) to load the data into JOSM
hu: Ez a feladat további adatok betöltésével jár. Kattints [ide](http://localhost:8111/import?new_layer=true&url={import_url}), hogy az adatok betöltődjenek a JOSM szerkesztőbe

source: Area modifications are not available yet.
hu: Területmódosítás most nem elérhető.

source: ${count} priority area
hu: ${count} prioritásos terület

source: If you want mappers to work on the highest priority areas first, draw one or more polygons within the project area.
hu: Ha szeretnéd, hogy a térképezők először a magas prioritású területeken dolgozzanak, rajzolj egy vagy több poligont a projekt területén belülre.

source: URL to service
hu: A szolgáltatás URL-je

source: Note:
hu: Megjegyzés:

source: Follow this format for TMS urls.<br>tms[22]:http://hiu-maps.net/hot/1.0.0/kathmandu_flipped/{zoom}/{x}/{y}.png
hu: TMS URL-ekhez köved ezt a formátumot.<br>tms[22]:http://hiu-maps.net/hot/1.0.0/kathmandu_flipped/{zoom}/{x}/{y}.png

source: Required License
hu: Szükséges licenc

source: Private
hu: Privát

source: Private means that only a given list of users can access this project. In order for the user's name to be available to add to the Allowed Users - they first must visit the URL for your instance of OSMTM and Authorize access to their OpenStreetMap account. After they've done this, their username should be available for the administrator to add.
hu: A privát projekteket csak a megadott felhasználók érhetik el. Ahhoz, hogy a felhasználók hozzáadhatóvá váljanak az Engedélyezett felhasználókhoz - először el kell látogassanak a te OSMTM-edre és engedélyezniük kell a hozzáférést az OpenStreetMap fiókjukhoz. Miután ezt megtették, a felhasználónevük elérhető lesz az adminisztrátorok számára.

source: Allowed users
hu: Engedélyezett felhasználók

source: Type a username
hu: Adj meg egy felhasználónevet

source: Add user
hu: Felhasználó hozzáadása

source: Project due date
hu: Projekt lejárati idő

source: The date after which the project will automatically be archived.
hu: A dátum, ami után a projekt automatikusan archiválódik.

source: JOSM Preset
hu: JOSM Címkekészlet

source: A JOSM Preset has already been added to this project.
hu: A projekthez JOSM Címkekészlet is tartozik.

source: Invalidation
hu: Érvénytelenítés

source: Invalidate All Tasks
hu: Minden feladat érvénytelenítése

source: Click this button if project instructions have changed, or if for some reason you need to invalidate all done tasks in a single step.
hu: Kattint a gombra, ha a projekt utasításai megváltoztak, vagy valami okból egyszerre kell érvénytelenítened az összes feladatot.

source: WARNING: This cannot be undone.
hu: FIGYELMEZTETÉS: Ez nem vonható vissza.

source: Tip:
hu: Tipp:

source: You can use <a href class="markdown">Markdown</a>. (HTML is not allowed)
hu: Használhatsz <a href class="markdown">Markdown</a> nyelvet. (A HTML nem engedélyezett)

source: Preview
hu: Előnézet

source: The list of elements we ask you to map
hu: Azon objektumok listája, amiknek a térképezésére kérünk téged

source: The default comment entered when uploading data to the OSM database. Please add to the default comment a description of what you actually mapped.
hu: Az alapértelmezett megjegyzés az OSM adatbázisba feltöltésnél. Kérlek, adj az alapéretelmezett megjegyzéshez egy leírást arról, hogy mit térképeztél.

source: When saving your work, please leave the default comment but add what you actually mapped, for example "added buildings and a residential road".
hu: Amikor elmented a munkádat, kérlek hagyd meg az alapértelmezett megjegyzést, de írd hozzá, mit térképeztél. Pl „épületek és lakóutak felrajzolva”.

source: preset
hu: címkekészletet

source: Using JOSM? Please use the dedicated ${preset_link}.
hu: JOSM-mel dolgozol? Kérlek, használd az ajánlott ${preset_link}.

source: Start contributing
hu: Közreműködés megkezdése

source: Export
hu: Exportálás

source: Contribute
hu: Közreműködés

source: Activity
hu: Aktivitás

source: Stats
hu: Statisztikák

source: Loading
hu: Betöltés

source: Task doesn't exist.
hu: Nincs ilyen feladat.

source: an error occured
hu: hiba történt

source: JOSM remote control did not respond. Do you have JOSM running and configured to be controlled remotely?
hu: A JOSM távirányító nem válaszol. Fut a JOSM és engedélyezve van benne a távirányítás?

source: Something wrong happened
hu: Valami baj történt

source: Please login first
hu: Előbb kérlek jelentkezz be

source: Map data © ${osm_link} contributors
hu: Térképadatok © ${osm_link} közreműködők

source: Cur. worked on
hu: Dolgoznak rajta

source: Ready
hu: Kész

source: Invalidated
hu: Érvénytelenített

source: Done
hu: Kész

source: Validated
hu: Érvényesített

source: You must leave a comment.
hu: Hagyj megjegyzést!

source: High priority
hu: Magas prioritás

source: Project New
hu: Új projekt

source: Draw the area of interest
hu: Rajzold meg az érintett területet

source: Dropped file could not be loaded
hu: Az ide dobott fájl nem lehet betölteni

source: Dropped file was unreadable
hu: Az ide dobott fájl nem olvasható

source: Please provide a .geojson, .kml, or zipped .shp file
hu: Kérlek adj egy .geojson, .kml, vagy tömörített .shp fájlt

source: Step ${number}
hu: ${number}. lépés

source: Draw
hu: Rajzold meg

source: ${draw_link} the area of interest on the map.
hu: ${draw_link} az érintett területet a térképen.

source: or
hu: vagy

source: Provide a .geojson, .kml, or zipped .shp file.
hu: Adj egy .geojson, .kml, vagy tömörített .shp fájlt.

source: Import
hu: Importálj

source: ${import_link} a <em>GeoJSON</em>, <em>KML</em>, or <em>zipped SHP</em> file.
hu: ${import_link} egy <em>GeoJSON</em>, <em>KML</em>, vagy <em>tömörített SHP</em> fájlt.

source: Want to use an <em>.osm</em> file instead?
hu: Szeretnél inkább egy <em>.osm</em> fájlt használni?

source: You can use ${geojson_link} to convert it to <em>GeoJSON</em>.
hu: A <em>GeoJSON</em>-be konvertáláshoz használhatod a ${geojson_link} szolgáltatást.

source: ${step_number} - Type of project
hu: ${step_number} - Projekt típusa

source: Square Grid
hu: Négyzetrács

source: Area of interest is automatically split into grid cells. Each one is a task.
hu: Az érintett terület automatikusan fel lett osztva cellákká. Mindegyik egy feladat.

source: You cannot select this option unless you import a file with polygons.
hu: Nem választhatod ezt a lehetőséget, ha nem importálsz poligonokat tartalmazó fájlt.

source: Arbitrary Geometries
hu: Tetszőleges geometriák

source: Each polygon represents a task.
hu: Minden sokszög egy feladatot ábrázol.

source: Back
hu: Előző

source: Next
hu: Következő

source: Tile size
hu: Csempeméret

source: Computing...
hu: Számítás…

source: A new project will be created with ${number} tasks.
hu: Egy új projekt lesz létrehozva ${number} feladattal.

source: Create project
hu: Projekt létrehozása

source: Creating tiles, please wait...
hu: Csempék létrehozása, kérlek várj…

source: Creating project, please wait...
hu: Projekt létrehozása, kérlek várj…

source: Contributors
hu: Közreműködők

source: Assigned
hu: Kiosztva

source: Welcome, new user!
hu: Üdvözlünk, új felhasználó!

source: You're ready to use the Tasking Manager.
hu: Készen állsz a Tasking Manager használatára.

source: Since you are the first user you'll be given admin rights.
hu: Mivel te vagy az első felhasználó, adminisztrátori jogosultságot kapsz.

source: Please login
hu: Kérlek, jelentkezz be

source: Assign task to someone
hu: Feladat hozzárendelése valakihez

source: Filter users
hu: Felhasználók szűrése

source: you
hu: te

source: Assigned to ${username}
hu: ${username} felhasználóhoz rendelve

source: Not assigned yet
hu: Még nincs kiosztva

source: Leave a comment
hu: Hagyj megjegyzést!

source: a task
hu: egy feladatot

source: You already have ${task_link} locked.
hu: Már zároltál ${task_link}

source: Select it again
hu: Válaszd ki újra

source: Hard
hu: Nehéz

source: Difficulty: hard<br>Level: advanced
hu: Nehézség: nehéz<br>Szint: tapasztat

source: Medium
hu: Közepes

source: Difficulty: medium<br>Level: intermediate
hu: Nehézség: közepes<br>Szint: haladó

source: Easy
hu: Könnyű

source: Difficulty: easy<br>Level: beginner
hu: Nehézség: könnyű<br>Szint: kezdő

source: Difficulty
hu: Nehézség

source: No difficulty set yet
hu: Még nincs nehézség beállítva

source: Unknown difficulty
hu: Ismeretlen nehézség

source: Edit with
hu: Szerkesztés ezzel

source: .gpx file
hu: .gpx fájlt

source: Tip: Download the following ${task_gpx_link} and load it in JOSM in order to see the current task boundary
hu: Tipp: Töltsd le ezt a ${task_gpx_link}, majd nyisd meg JOSM-ben, hogy lásd a terület határát

source: Select a task on the map
hu: Feladat kiválasztása a térképen

source: Take a task at random
hu: Feladat választása találomra

source: Comment
hu: Megjegyzés

source: ${user} marked ${tasklink} as <b>done</b>
hu: ${tasklink} feladatot ${user} <b>késznek</b> jelölte

source: ${user} <b>invalidated</b> ${tasklink}
hu: ${tasklink} feladatot ${user} <b>érvénytelenítette</b>

source: ${user} <b>validated</b> ${tasklink}
hu: ${tasklink} feladatot ${user} <b>érvényesítette</b>

source: Marked as done
hu: Késznek jelölte:

source: <b>Split</b> by ${link}
hu: <b>Felosztotta:</b> ${link}

source: Locked
hu: Zárolva

source: Unlocked
hu: Feloldva

source: Comment left
hu: Megjegyzést hagyott:

source: Nothing has happened yet.
hu: Még nem történt semmi.

source: Extra Instructions
hu: További utasítások

source: Locked by ${username}
hu: Zárolta: ${username}

source: Stop mapping
hu: Térképezés abbahagyása

source: If you do not complete or release this task in time, it will be automatically unlocked
hu: Ha nem fejezed be, vagy oldod fel a feladatot időben, a zárolás automatikusan feloldódik

source: min. left
hu: perc van hátra

source: Clear selection
hu: Kiválasztás törlése

source: Task #${number}
hu: #${number} feladat

source: See the changesets in the OSM database for this area.
hu: A terület módosításcsomagjainak megtekintése az OSM adatbázisban.

source: OSM changesets
hu: OSM módosításcsomagok

source: See the changes in this area using overpass turbo.
hu: A terület változtatásainak megtekintése overpass turbo segítségével.

source: Task is too big?
hu: Túl nagy a feladat?

source: You cannot split this task more.
hu: Nem oszthatod a feladatot kisebb részekre.

source: Are you sure you want to split this task?
hu: Biztosan kisebb részekre osztod a feladatot?

source: Split
hu: Felosztás

source: Invalidate this task if you consider it needs more work.
hu: Érvénytelenítsd a feladatot, ha úgy ítéled meg, hogy további munkát igényel.

source: Unlock
hu: Feloldás

source: Invalidate
hu: Érvénytelenítés

source: Validate this task if you consider that the work is complete.
hu: Érvényesítsd a feladatot, ha a munkát késznek ítéled meg.

source: You cannot validate a task that you have personally marked as done.
hu: Te nem érvényesítheted a feladatot, mert te jelölted késznek.

source: Validate
hu: Érvényesítés
